Revit 2027 API
Categories.NewSubcategory Method
Add a new subcategory into the Autodesk Revit document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Category NewSubcategory(
	Category parentCategory,
	string name
)
Public Function NewSubcategory (
	parentCategory As Category,
	name As String
) As Category
public:
Category^ NewSubcategory(
	Category^ parentCategory,
	String^ name
)
member NewSubcategory :
        parentCategory : Category *
        name : string -> Category
Parameters
parentCategory Category
 The parent category.
name String
 The new category name.
Return Value
Category
If successful, the newly created subcategory.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"parentCategory" or "name"-is null.
ArgumentException |  Thrown when the input argument-"parentCategory"-cannot add subcategory. Thrown when the input argument-"name"-is an illegal name.
InvalidOperationException |  Thrown when subcategory creation failed.
Example
public void AssignSubCategory(Document document, GenericForm extrusion)
{
    // create a new subcategory
    Category cat = document.OwnerFamily.FamilyCategory;
    Category subCat = document.Settings.Categories.NewSubcategory(cat, "NewSubCat");
    // create a new material and assign it to the subcategory
    ElementId materialId = Material.Create(document, "Wood Material");
    subCat.Material = document.GetElement(materialId) as Material;
    // assign the subcategory to the element
    extrusion.Subcategory = subCat;
}
See Also
Reference
Categories Class
Autodesk.Revit.DB Namespace